In [2]:
## python imports
import pandas as pd

In [3]:
path= 'data/userdata1.parquet'
columns = ['id', 'first_name', 'last_name', 'country',]

In [4]:
df = pd.read_parquet(path, columns=columns, engine='pyarrow')

In [5]:
%%time
df

CPU times: user 1e+03 ns, sys: 1e+03 ns, total: 2 µs
Wall time: 4.53 µs

       id first_name last_name       country
0       1     Amanda    Jordan     Indonesia
1       2     Albert   Freeman        Canada
2       3     Evelyn    Morgan        Russia
3       4     Denise     Riley         China
4       5     Carlos     Burns  South Africa
..    ...        ...       ...           ...
995   996     Dennis    Harris        Greece
996   997     Gloria  Hamilton         China
997   998      Nancy    Morris        Sweden
998   999      Annie   Daniels         China
999  1000      Julie     Meyer         China

[1000 rows x 4 columns]